app/controllers/api/v1/authentication_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'meysamzohoori.mehriz@gmail.com' LIMIT 1
---
        def authenticate

          user = User.find_by(email: params[:email])