app/controllers/api/v1/base_controller.rb

      def authenticate_user!
        token = request.headers['Authorization']&.split(' ')&.last
        if token.present?
          if Redis.current.sismember('blacklisted_jwts', token)
            render json: { error: 'Token is blacklisted' }, status: :unauthorized
          else
            begin
              payload = JWT.decode(token, Rails.application.secrets.secret_key_base).first
              @current_user = User.find(payload['user_id'])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1